app/Controllers/Admin.php

    public function index()
    {
        $userModel = new UserModel();
        $orderModel = new OrderModel();
        $complaintModel = new ComplaintModel();

        $data = [
            'title' => 'Admin Dashboard',
            'total_users' => $userModel->countAll(),
            'total_orders' => $orderModel->countAll(),
            'pending_orders' => $orderModel->where('status', 'pending')->countAllResults(),
            'open_complaints' => $complaintModel->where('status', 'open')->countAllResults()
---
SELECT COUNT(*) AS `numrows` FROM `users`
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `complaints`
WHERE `status` = 'open'