app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'staff'
 LIMIT 1
---
    public function loginPost()
    {
        helper(['form']);
        $session = session();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();