app/Controllers/ChatController.php

    public function sendMessage()
    {
        $messageModel = new ChatMessageModel();
        $userId = session()->get('id');
        $userRole = session()->get('role');
        $message = $this->request->getPost('message');

        if (empty(trim($message))) {
            return $this->response->setJSON(['success' => false, 'error' => 'Message cannot be empty']);
        }

        $data = [
            'user_id' => $userId,
            'user_role' => $userRole,
            'message' => trim($message),
            'created_at' => date('Y-m-d H:i:s')
        ];

        if ($messageModel->insert($data)) {
---
INSERT INTO `chat_messages` (`user_id`, `user_role`, `message`, `created_at`) VALUES ('2', 'staff', '.....', '2025-09-30 16:15:32')