app/Controllers/Customer.php

SELECT *
FROM `orders`
WHERE `user_id` = '3'
ORDER BY `created_at` DESC
---
    public function orders()
    {
        $userId = session()->get('id');
        $orderModel = new OrderModel();
        $orders = $orderModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `orders`
WHERE `id` = '1'
AND `user_id` = '3'
 LIMIT 1
---
    public function orderDetail($orderId)
    {
        $userId = session()->get('id');
        $orderModel = new OrderModel();
        $order = $orderModel->where('id', $orderId)->where('user_id', $userId)->first();