app/Controllers/Staff.php

SELECT *
FROM `order_assignments`
WHERE `staff_id` = '2'
AND `active` = 1
---
    public function orders()
    {
        $session = session();
        $staffId = $session->get('id');

        $assignmentModel = new OrderAssignmentModel();
        $orderModel = new OrderModel();

        $assignments = $assignmentModel
            ->where('staff_id', $staffId)
            ->where('active', 1)
            ->findAll();